spec.org
#+title: Assignment 4 Specification and Requirements Documents
#+author: Omar Alkersh - alkersho
#+options: toc:nil num:1
#+latex_header: \usepackage[a4paper, margin=1in]{geometry} \usepackage[utf8]{inputenc}
#+TODO: TODO(t) NEXT(n) | DONE(d) CONFUSED(c) TOCHANGE(g)

The specification for /Two Dots/ consists of ~Controller~, the main controller in the CV, ~View~, the module responsible for the view, ~BoardT~, the module holding the board information, ~GameState~ interface, the interface responsible for the win and lose conditions, and the three implementing modules of ~GameState~.

The game is a 2 dimensional board which consists of coloured dots. The main action of the game is to connect at least two adjacent dots, not diagonally. Connecting dots consumes them, lowering the above dots to fill the gap then populates the empty top spots with new random dots. The win and lose conditions are defined by the game type.

There are three specified game types:

- Timer:
  - Gives the player a timer until the game is finished. The player aims to achieve the highest score during the time by connecting dot.
- Score:
  - The player tries to achieve a set score. When achieved the game ends and the player "wins"
- Moves:
  - The player has a limited number of moves before the game is over. During which he have to score a set score else he loses.

\newpage
* DONE Board Module
  CLOSED: [2020-03-29 Sun 00:47]

** Template Module
   BoardT

** Uses
   GameState

** Syntax

*** Exported Constants
    SIZE = 6

*** Exported Types

    Colour = {Blue, Green, Pink, Red, Orange}\\
    BoardT = ?

*** Exported Access Program
   | Routine name | In                                           | Out    | Exception                                           |
   | /            | <>                                           | <>     | <                                                   |
   |--------------+----------------------------------------------+--------+-----------------------------------------------------|
   | BoardT       | GameState                                    | BoardT |                                                     |
   | consume      | set(tuple(i: $\mathbb{N}$, j: $\mathbb{N}$)) |        | IndexOutOfBoundsException, IllegalArgumentException |
   | updateBoard  |                                              |        |                                                     |
   | getCell      | $\mathbb{N}$, $\mathbb{N}$                   | Colour | IndexOutOfBoundsException                           |

*** Semantics

**** State Variables

     b: seq (seq (Colour))

     state: GameState

**** State Invariant

     $|b| = SIZE$

     $\forall i, j: i, j \in \mathbb{N} \land 0 \leq i,j < |b| \bullet |b[i]| = |b[j]| \land |b[i]| = SIZE$

**** Assumptions

     BoardT is called before any other routine is called.

**** Access Routine Semantics

     ~new~ BoardT(gs):
     + transition: $state, b := gs, board$ such that $\forall i, j: i,j \in \mathbb{N} \land 0 \leq i,j < SIZE \bullet board[i][j] \neq Null$
     + output: $out := self$
     + exception: None


     consume(set):
     + transition: The set of "coordinates" are set to ~Null~, then it calls state.update(|set|, getCell(c)) where $c \in set$.
       + Coordinates are entries in the 2D array.
       + Down means that the object moves to the row below. If an object is at s[i][j], where $i \neq 0$ then moving down will put it at s[i-1][j].
     + output: None
     + Exception: $exc:= \exists c: c \in set \bullet ¬ (0 \leq c.i < SIZE \land 0\leq c.j < SIZE) \implies IndexOutOfBoundsException$ | $\lnot \forall i, j ,k, l : i, j, k, l \in \mathbb{N} \land i < SIZE \land j < SIZE \land k < SIZE \land l < SIZE \bullet b[i][j] = b[k][l]$

     updateBoard()
     + transition: All non-null cells are moved "down". Finally the remaining ~Null~ cells are set to different colours.
     + output: None
     + Exception: None

     getCell(i, j)
     + transition: None
     + output: $out := b[i][j]$
     + Exception: $exc := ¬ (0 \leq i < SIZE \land 0 \leq j < SIZE) \implies IndexOutOfBoundsException$

\newpage
* TODO Controller Module
** Abstract Object Module
   Controller
** Uses
   GameState, BoardT, View
** Syntax
*** Exported Constants
*** Exported Types
*** Exported Access Program
    | Routine name     | In | Out        | Exception |
    |------------------+----+------------+-----------|
    | /                | <> | <>         | <         |
    | Controller       |    | Controller |           |
    | running          |    |            |           |
    | handleBoardClick |    |            |           |
    | loseFocus        |    |            |           |
    | exit             |    |            |           |

*** Semantics
**** State Variables

     board: BoardT

     game: GameState

     win: View

**** Environment Variables
**** State Invariant
**** Assumptions
     All methods are run after ~Controller~.

    ~run~ is the program main loop. It is called right after ~Controller~

    ~loseFocus~ and ~handleBoardClick~ are even listeners used by the GUI library.

**** Access Routine Semantics
**** Local Functions


\newpage
* NEXT View Module
** Abstract Object Module
   View
** Uses

** Syntax
*** Exported Constants
*** Exported Types
    View = ?
*** Exported Access Program
    | Routine name   | In                                                             | Out | Exception |
    | /              | <>                                                             | <>  | <         |
    |----------------+----------------------------------------------------------------+-----+-----------|
    | View           |                                                                |     |           |
    | gameMenu       |                                                                |     |           |
    | startGame      | GameState, BoardT                                              |     |           |
    | showPause      |                                                                |     |           |
    | showWin        |                                                                |     |           |
    | showLose       |                                                                |     |           |
    | updateBoard    |                                                                |     |           |
    | connectToMouse | $(\mathbb{N}, \mathbb{N})$, Colour                             |     |           |
    | drawConnection | $(\mathbb{N}, \mathbb{N})$, $(\mathbb{N}, \mathbb{N})$, Colour |     |           |

*** Semantics
**** State Variables

     board: BoardT

     game: GameState

**** Environment Variables
     screen : The screen.
**** State Invariant
**** Assumptions
     All functions are called after View has been called.

     startGame is called after gameMenu.

     gamePause is called after startGame.

     showWin and showLose are called only when $state.running() = false$.

     updateBoard is called only after startGame and while $state.running() = true$.

