spec.tex
% Created 2020-03-31 Tue 19:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper, margin=1in]{geometry} \usepackage[utf8]{inputenc}
\setcounter{secnumdepth}{1}
\author{Omar Alkersh - alkersho}
\date{\today}
\title{Assignment 4 Specification and Requirements Documents}
\hypersetup{
 pdfauthor={Omar Alkersh - alkersho},
 pdftitle={Assignment 4 Specification and Requirements Documents},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)},
 pdflang={English}}
\begin{document}

\maketitle
The specification for \emph{Two Dots} consists of \texttt{Controller}, the main controller in the CV, \texttt{View}, the module responsible for the view, \texttt{BoardT}, the module holding the board information, \texttt{GameState} interface, the interface responsible for the win and lose conditions, and the three implementing modules of \texttt{GameState}.

The game is a 2 dimensional board which consists of coloured dots. The main action of the game is to connect at least two adjacent dots, not diagonally. Connecting dots consumes them, lowering the above dots to fill the gap then populates the empty top spots with new random dots. The win and lose conditions are defined by the game type.

There are three specified game types:

\begin{itemize}
\item Timer:
\begin{itemize}
\item Gives the player a timer until the game is finished. The player aims to achieve the highest score during the time by connecting dot.
\end{itemize}
\item Score:
\begin{itemize}
\item The player tries to achieve a set score. When achieved the game ends and the player "wins"
\end{itemize}
\item Moves:
\begin{itemize}
\item The player has a limited number of moves before the game is over. During which he have to score a set score else he loses.
\end{itemize}
\end{itemize}

\newpage
\section{{\bfseries\sffamily DONE} Board Module}
\label{sec:org2fdce5b}
\subsection*{Template Module}
\label{sec:orge6c4914}
BoardT

\subsection*{Uses}
\label{sec:orgbe5ffa2}
GameState

\subsection*{Syntax}
\label{sec:orge6491a5}

\subsubsection*{Exported Constants}
\label{sec:orga98ccf0}
SIZE = 6

\subsubsection*{Exported Types}
\label{sec:org58e6a89}

Colour = \{Blue, Green, Pink, Red, Orange\}\\
BoardT = ?

\subsubsection*{Exported Access Program}
\label{sec:org5e62de5}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
BoardT & GameState & BoardT & \\
consume & set(tuple(i: \(\mathbb{N}\), j: \(\mathbb{N}\))) &  & IndexOutOfBoundsException, IllegalArgumentException\\
updateBoard &  &  & \\
getCell & \(\mathbb{N}\), \(\mathbb{N}\) & Colour & IndexOutOfBoundsException\\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:org26b2056}

\begin{itemize}
\item State Variables
\label{sec:org984a062}

b: seq (seq (Colour))

state: GameState

\item State Invariant
\label{sec:org94750e7}

\(|b| = SIZE\)

\(\forall i, j: i, j \in \mathbb{N} \land 0 \leq i,j < |b| \bullet |b[i]| = |b[j]| \land |b[i]| = SIZE\)

\item Assumptions
\label{sec:org7582e48}

BoardT is called before any other routine is called.

\item Access Routine Semantics
\label{sec:orgbdddedf}

\texttt{new} BoardT(gs):
\begin{itemize}
\item transition: \(state, b := gs, board\) such that \(\forall i, j: i,j \in \mathbb{N} \land 0 \leq i,j < SIZE \bullet board[i][j] \neq Null\)
\item output: \(out := self\)
\item exception: None
\end{itemize}


consume(set):
\begin{itemize}
\item transition: The set of "coordinates" are set to \texttt{Null}, then it calls state.update(|set|, getCell(c)) where \(c \in set\).
\begin{itemize}
\item Coordinates are entries in the 2D array.
\item Down means that the object moves to the row below. If an object is at s[i][j], where \(i \neq 0\) then moving down will put it at s[i-1][j].
\end{itemize}
\item output: None
\item Exception: \(exc:= \exists c: c \in set \bullet ¬ (0 \leq c.i < SIZE \land 0\leq c.j < SIZE) \implies IndexOutOfBoundsException\) | \(\lnot \forall i, j ,k, l : i, j, k, l \in \mathbb{N} \land i < SIZE \land j < SIZE \land k < SIZE \land l < SIZE \bullet b[i][j] = b[k][l]\)
\end{itemize}

updateBoard()
\begin{itemize}
\item transition: All non-null cells are moved "down". Finally the remaining \texttt{Null} cells are set to different colours.
\item output: None
\item Exception: None
\end{itemize}

getCell(i, j)
\begin{itemize}
\item transition: None
\item output: \(out := b[i][j]\)
\item Exception: \(exc := ¬ (0 \leq i < SIZE \land 0 \leq j < SIZE) \implies IndexOutOfBoundsException\)
\end{itemize}

\newpage
\end{itemize}
\section{{\bfseries\sffamily TODO} Controller Module}
\label{sec:org2386cca}
\subsection*{Abstract Object Module}
\label{sec:org16b78a3}
Controller
\subsection*{Uses}
\label{sec:org301cbe7}
GameState, BoardT, View
\subsection*{Syntax}
\label{sec:org4c8caa0}
\subsubsection*{Exported Constants}
\label{sec:org73b62d8}
\subsubsection*{Exported Types}
\label{sec:org2508760}
\subsubsection*{Exported Access Program}
\label{sec:orgddbdea2}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
Controller &  & Controller & \\
running &  &  & \\
handleBoardClick &  &  & \\
loseFocus &  &  & \\
exit &  &  & \\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:org17ac65b}
\begin{itemize}
\item State Variables
\label{sec:org318c29a}

board: BoardT

game: GameState

win: View

\item Environment Variables
\label{sec:orgff28d91}
\item State Invariant
\label{sec:orga5c8485}
\item Assumptions
\label{sec:org87c9471}
All methods are run after \texttt{Controller}.

\texttt{run} is the program main loop. It is called right after \texttt{Controller}

\texttt{loseFocus} and \texttt{handleBoardClick} are even listeners used by the GUI library.

\item Access Routine Semantics
\label{sec:orgd876730}
\item Local Functions
\label{sec:orge9b3482}


\newpage
\end{itemize}
\section{{\bfseries\sffamily NEXT} View Module}
\label{sec:org827f7aa}
\subsection*{Abstract Object Module}
\label{sec:orgf2401ff}
View
\subsection*{Uses}
\label{sec:org3d6ea8e}

\subsection*{Syntax}
\label{sec:org08c8cbb}
\subsubsection*{Exported Constants}
\label{sec:org5dcbd1c}
\subsubsection*{Exported Types}
\label{sec:orga63a7dd}
View = ?
\subsubsection*{Exported Access Program}
\label{sec:orga4c6146}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
View &  &  & \\
gameMenu &  &  & \\
startGame & GameState, BoardT &  & \\
showPause &  &  & \\
showWin &  &  & \\
showLose &  &  & \\
updateBoard &  &  & \\
connectToMouse & \((\mathbb{N}, \mathbb{N})\), Colour &  & \\
drawConnection & \((\mathbb{N}, \mathbb{N})\), \((\mathbb{N}, \mathbb{N})\), Colour &  & \\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:orgfa2f7f7}
\begin{itemize}
\item State Variables
\label{sec:org5c691b2}

board: BoardT

game: GameState

\item Environment Variables
\label{sec:orgca3697f}
screen : The screen.
\item State Invariant
\label{sec:org9ca4e2b}
\item Assumptions
\label{sec:org1fa4929}
All functions are called after View has been called.

startGame is called after gameMenu.

gamePause is called after startGame.

showWin and showLose are called only when \(state.running() = false\).

updateBoard is called only after startGame and while \(state.running() = true\).

\item Access Routine Semantics
\label{sec:org4da63ad}

\texttt{new} View():
\begin{itemize}
