spec.org
**** Access Routine Semantics

     ~new~ View():
     + transition: screen := Shows a window in the screen with buttons; "Start Game", "Quit".
       + Start Game: Returns "Start Game" message.
       + Quit: Returns "Quit" message.
     + output: out := Selected option.
     + Exception: None

     gameMenu()
     + transition: screen := Shows a menu with a button for each of the available game mode.
     + output: The code for the selected game mode.
     + Exception: None

     startGame(game, b):
     + transition: game, board, screen := game, b, shows a grid with coloured dots to represent the board with b[0] being the bottom most row and labels to represent the current game mode/state.
     + output: None.
     + Exception: None

     showPause():
     + transition: screen := Shows a menu with "Continue" and "Quit" options.
       + Also calls game.pause() if game is StateTimer
     + output: The chosen option.
     + Exception: None

     showWin():
     + transition: screen := Shows a "win" message with buttons "Quit".
     + output: The "Quit" message when selected.
     + Exception: None

     showLose():
     + transition: screen := Shows a "lose" message with buttons "Quit".
     + output: The "Quit" message when selected.
     + Exception: None

     updateBoard():
     + transition: screen := update the grid to represent the ~board~.
     + output: None
     + Exception: None

     drawConnection(coord1, coord2, c):
     + transition: screen := Draws a coloured line same colour as ~c~ from dot at coord1 to dot at coord2.
     + output: None
     + Exception: None

     connectToMouse(coord, c):
     + transition: screen := Draw a coloured line same colour as ~c~ from dot at coord to the current mouse position.
     + output: None
     + Exception: None

**** Local Functions


\newpage
* DONE Game State Module
  CLOSED: [2020-03-29 Sun 00:47]

** Interface
   GameState

** Uses
   None

** Syntax
*** Exported Constants
    None

*** Exported Types
    State = {Win, Lose, Running}

*** Exported Access Program
    | Routine name | In                   | Out          | Exception |
    | /            | <>                   | <>           | <         |
    |--------------+----------------------+--------------+-----------|
    | update       |                      |              |           |
    | update       | $\mathbb{N}, Colour$ |              |           |
    | state        |                      | State        |           |
    | running      |                      | $\mathbb{B}$ |           |

*** Semantics
**** State Variables
     state: State

**** Access Routine Semantics

     state()
     + transition: None
     + output: $out := state$
     + Exception: None

     running()
     + transition: None
     + output: $out := state = Running$
     + Exception: None

\newpage
* DONE State Timer Module
  CLOSED: [2020-03-31 Tue 19:14] SCHEDULED: <2020-03-30 Mon>
** Template Module inherits GameState
   StateTime

** Uses
   GameState, BoardT

** Syntax
*** Exported Constants
    None

*** Exported Types
    StateTime = ?

*** Exported Access Routine
| Routine name | In                         | Out          | Exception |
| /            | <>                         | <>           | <         |
|--------------+----------------------------+--------------+-----------|
| StateTime    | $\mathbb{N}$, $\mathbb{N}$ | StateTime    |           |
| getScore     |                            | $\mathbb{N}$ |           |
| getRemTime   |                            | $\mathbb{R}$ |           |
| pause        |                            |              |           |
| unPause      |                            |              |           |
| isPaused     |                            | $\mathbb{B}$ |           |

*** Semantics
**** State Variables

     $endTime: \mathbb{R}$

     $curTime: \mathbb{R}$

     $score: \mathbb{N}$

     $scoreGoal: \mathbb{N}$

     $paused: \mathbb{B}$

**** Environment Variables

     sysTime: The current system time in seconds.

**** State Invariant

     $endTime > 0$

**** Assumption

     StateTime is called before any other method is called.

**** Access Routine Semantics

     ~new~ StateTime(i, t):
     + transition: $paused, state, curTime, endTime, score, scoreGoal := false, Running, sysTime, sysTime + t, 0, i$
     + output: $out := self$
     + Exception: None

     update()
     - transition: $curTime, state := sysTime, (endTime > curTime \implies Running | endTime \leq curTime \implies (score < scoreGoal \implies Lose | True \implies Win))$
     - output: None
     - Exception: None

     update(n, c)
     - transition: $paused, score, curTime, state := False, score + calcScore(n, c), sysTime, (endTime > curTime \implies Running | endTime \leq curTime \implies (score < scoreGoal \implies Lose | True \implies Win))$
     - output: None
     - Exception: None

     getScore()
     - transition:
     - output: $out := score$
     - Exception: None

     getRemTime()
     - transition:
     - output: $out := endTime - curTime$
     - Exception: None

     unPause()
     - transition: $paused := False$
     - output: None
     - Exception: None

     pause()
     - transition: $paused := True$
     - output: None
     - Exception: None

     isPaused()
     - transition: None
     - output: $out := paused$
     - Exception: None

**** Local Functions

     calcScore: $\mathbb{N} \times Colour \rightarrow \mathbb{N}$ \\
     $calcScore t = ?$

\newpage
* DONE State Score Module
  CLOSED: [2020-03-31 Tue 19:14] SCHEDULED: <2020-03-30 Mon>
** Template Module Inherits GameState
   StateScore
** Uses
   GameState
** Syntax
*** Exported Constants
    None

*** Exported Types
    StateScore = ?

*** Exported Access Routine
| Routine name | In           | Out          | Exception |
| /            | <>           | <>           | <         |
|--------------+--------------+--------------+-----------|
| StateScore   | $\mathbb{N}$ | StateScore   |           |
| getScore     |              | $\mathbb{N}$ |           |
| getMaxScore  |              | $\mathbb{N}$ |           |

*** Semantics

**** State Variables

     $score: \mathbb{N}$

     $scoreGoal: \mathbb{N}$

**** State Invariant

     $0 \leq score \leq scoreGoal$

**** Assumptions

     StateScore is called before any other routine.

**** Access Routine Semantics

     ~new~ StateScore(i)
     + transition: $state, score, scoreGoal := Running, 0, i$
     + output: $out := self$
     + Exception None

     update()
     + transition: None
     + output: None
     + Exception: None

     update(n, c)
     + transition: $score, state := score + calcScore(n, c), (score \geq scoreGoal \implies Win | True \implies Running)$
     + output: None
     + Exception: None

     getScore()
     - transition:
     - output: $out := score$
     - Exception: None

     getMaxScore()
     - transition:
     - output: $out := scoreGoal$
     - Exception: None

**** Local Functions

     calcScore: $\mathbb{N} \times Colour \rightarrow \mathbb{N}$ \\
     $calcScore t = ?$

\newpage
* DONE State Moves Module
  CLOSED: [2020-03-31 Tue 19:14] SCHEDULED: <2020-03-30 Mon>

** Template Module Inherits GameState
   StateMoves

** Uses
   GameState

** Syntax

*** Exported Constants

*** Exported Types
    StateMoves

