spec.tex
\item transition: screen := Shows a window in the screen with buttons; "Start Game", "Quit".
\begin{itemize}
\item Start Game: Returns "Start Game" message.
\item Quit: Returns "Quit" message.
\end{itemize}
\item output: out := Selected option.
\item Exception: None
\end{itemize}

gameMenu()
\begin{itemize}
\item transition: screen := Shows a menu with a button for each of the available game mode.
\item output: The code for the selected game mode.
\item Exception: None
\end{itemize}

startGame(game, b):
\begin{itemize}
\item transition: game, board, screen := game, b, shows a grid with coloured dots to represent the board with b[0] being the bottom most row and labels to represent the current game mode/state.
\item output: None.
\item Exception: None
\end{itemize}

showPause():
\begin{itemize}
\item transition: screen := Shows a menu with "Continue" and "Quit" options.
\begin{itemize}
\item Also calls game.pause() if game is StateTimer
\end{itemize}
\item output: The chosen option.
\item Exception: None
\end{itemize}

showWin():
\begin{itemize}
\item transition: screen := Shows a "win" message with buttons "Quit".
\item output: The "Quit" message when selected.
\item Exception: None
\end{itemize}

showLose():
\begin{itemize}
\item transition: screen := Shows a "lose" message with buttons "Quit".
\item output: The "Quit" message when selected.
\item Exception: None
\end{itemize}

updateBoard():
\begin{itemize}
\item transition: screen := update the grid to represent the \texttt{board}.
\item output: None
\item Exception: None
\end{itemize}

drawConnection(coord1, coord2, c):
\begin{itemize}
\item transition: screen := Draws a coloured line same colour as \texttt{c} from dot at coord1 to dot at coord2.
\item output: None
\item Exception: None
\end{itemize}

connectToMouse(coord, c):
\begin{itemize}
\item transition: screen := Draw a coloured line same colour as \texttt{c} from dot at coord to the current mouse position.
\item output: None
\item Exception: None
\end{itemize}

\item Local Functions
\label{sec:orgb335533}


\newpage
\end{itemize}
\section{{\bfseries\sffamily DONE} Game State Module}
\label{sec:org1e4e2a0}
\subsection*{Interface}
\label{sec:orgfe4b6d6}
GameState

\subsection*{Uses}
\label{sec:org23793b5}
None

\subsection*{Syntax}
\label{sec:orgce6dc09}
\subsubsection*{Exported Constants}
\label{sec:org51ebac4}
None

\subsubsection*{Exported Types}
\label{sec:org5c6878b}
State = \{Win, Lose, Running\}

\subsubsection*{Exported Access Program}
\label{sec:org1ebe01b}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
update &  &  & \\
update & \(\mathbb{N}, Colour\) &  & \\
state &  & State & \\
running &  & \(\mathbb{B}\) & \\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:org09eac64}
\begin{itemize}
\item State Variables
\label{sec:org1d8d495}
state: State

\item Access Routine Semantics
\label{sec:org3794926}

state()
\begin{itemize}
\item transition: None
\item output: \(out := state\)
\item Exception: None
\end{itemize}

running()
\begin{itemize}
\item transition: None
\item output: \(out := state = Running\)
\item Exception: None
\end{itemize}

\newpage
\end{itemize}
\section{{\bfseries\sffamily DONE} State Timer Module}
\label{sec:org7c13b22}
\subsection*{Template Module inherits GameState}
\label{sec:orgc27d792}
StateTime

\subsection*{Uses}
\label{sec:org55ab6e6}
GameState, BoardT

\subsection*{Syntax}
\label{sec:orgf925ac6}
\subsubsection*{Exported Constants}
\label{sec:org5ba026b}
None

\subsubsection*{Exported Types}
\label{sec:org0f21311}
StateTime = ?

\subsubsection*{Exported Access Routine}
\label{sec:org3593f86}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
StateTime & \(\mathbb{N}\), \(\mathbb{N}\) & StateTime & \\
getScore &  & \(\mathbb{N}\) & \\
getRemTime &  & \(\mathbb{R}\) & \\
pause &  &  & \\
unPause &  &  & \\
isPaused &  & \(\mathbb{B}\) & \\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:org1d79131}
\begin{itemize}
\item State Variables
\label{sec:org05a5113}

\(endTime: \mathbb{R}\)

\(curTime: \mathbb{R}\)

\(score: \mathbb{N}\)

\(scoreGoal: \mathbb{N}\)

\(paused: \mathbb{B}\)

\item Environment Variables
\label{sec:org2f038a6}

sysTime: The current system time in seconds.

\item State Invariant
\label{sec:org3145781}

\(endTime > 0\)

\item Assumption
\label{sec:orgd5890a5}

StateTime is called before any other method is called.

\item Access Routine Semantics
\label{sec:org2207032}

\texttt{new} StateTime(i, t):
\begin{itemize}
\item transition: \(paused, state, curTime, endTime, score, scoreGoal := false, Running, sysTime, sysTime + t, 0, i\)
\item output: \(out := self\)
\item Exception: None
\end{itemize}

update()
\begin{itemize}
\item transition: \(curTime, state := sysTime, (endTime > curTime \implies Running | endTime \leq curTime \implies (score < scoreGoal \implies Lose | True \implies Win))\)
\item output: None
\item Exception: None
\end{itemize}

update(n, c)
\begin{itemize}
\item transition: \(paused, score, curTime, state := False, score + calcScore(n, c), sysTime, (endTime > curTime \implies Running | endTime \leq curTime \implies (score < scoreGoal \implies Lose | True \implies Win))\)
\item output: None
\item Exception: None
\end{itemize}

getScore()
\begin{itemize}
\item transition:
\item output: \(out := score\)
\item Exception: None
\end{itemize}

getRemTime()
\begin{itemize}
\item transition:
\item output: \(out := endTime - curTime\)
\item Exception: None
\end{itemize}

unPause()
\begin{itemize}
\item transition: \(paused := False\)
\item output: None
\item Exception: None
\end{itemize}

pause()
\begin{itemize}
\item transition: \(paused := True\)
\item output: None
\item Exception: None
\end{itemize}

isPaused()
\begin{itemize}
\item transition: None
\item output: \(out := paused\)
\item Exception: None
\end{itemize}

\item Local Functions
\label{sec:orgdfcccda}

calcScore: \(\mathbb{N} \times Colour \rightarrow \mathbb{N}\) \\
\(calcScore t = ?\)

\newpage
\end{itemize}
\section{{\bfseries\sffamily DONE} State Score Module}
\label{sec:org41ada9b}
\subsection*{Template Module Inherits GameState}
\label{sec:org861bf70}
StateScore
\subsection*{Uses}
\label{sec:org495d861}
GameState
\subsection*{Syntax}
\label{sec:org2d3278a}
\subsubsection*{Exported Constants}
\label{sec:orge63e91e}
None

\subsubsection*{Exported Types}
\label{sec:orgbe61105}
StateScore = ?

\subsubsection*{Exported Access Routine}
\label{sec:org1824241}
\begin{center}
\begin{tabular}{l|l|l|l}
Routine name & In & Out & Exception\\
\hline
StateScore & \(\mathbb{N}\) & StateScore & \\
getScore &  & \(\mathbb{N}\) & \\
getMaxScore &  & \(\mathbb{N}\) & \\
\end{tabular}
\end{center}

\subsubsection*{Semantics}
\label{sec:orga97d415}

\begin{itemize}
\item State Variables
\label{sec:orgd3b30c2}

\(score: \mathbb{N}\)

\(scoreGoal: \mathbb{N}\)

\item State Invariant
\label{sec:org2e92781}

\(0 \leq score \leq scoreGoal\)

\item Assumptions
\label{sec:orga54f3f5}

StateScore is called before any other routine.

\item Access Routine Semantics
\label{sec:org9a6674f}

\texttt{new} StateScore(i)
\begin{itemize}
\item transition: \(state, score, scoreGoal := Running, 0, i\)
\item output: \(out := self\)
\item Exception None
\end{itemize}

update()
\begin{itemize}
\item transition: None
\item output: None
\item Exception: None
\end{itemize}

update(n, c)
\begin{itemize}
\item transition: \(score, state := score + calcScore(n, c), (score \geq scoreGoal \implies Win | True \implies Running)\)
\item output: None
\item Exception: None
\end{itemize}

getScore()
\begin{itemize}
\item transition:
\item output: \(out := score\)
\item Exception: None
\end{itemize}

getMaxScore()
\begin{itemize}
\item transition:
\item output: \(out := scoreGoal\)
\item Exception: None
\end{itemize}

\item Local Functions
\label{sec:org2811b82}

calcScore: \(\mathbb{N} \times Colour \rightarrow \mathbb{N}\) \\
\(calcScore t = ?\)

\newpage
\end{itemize}
\section{{\bfseries\sffamily DONE} State Moves Module}
\label{sec:org9084762}
